# Data Structure - 3
-  pandas

## Pandas
-  http://cs231n.github.io/python-numpy-tutorial/
-  pandas - dataframe, excel like 
-  https://mode.com/python-tutorial/pandas-dataframe/ 
-  https://pandas.pydata.org/pandas-docs/stable/
-

In [5]:
import pandas as pd
import numpy as np
import os
#https://pandas.pydata.org/
print(pd.__version__)

2.0.3

In [21]:
#help(os)

In [8]:
#from list
my_list = [1,2,3,4,5,10]
df = pd.DataFrame(my_list , columns = ['columnName'],)
df

   columnName
0           1
1           2
2           3
3           4
4           5
5          10

In [9]:
# from dictionary
my_dict = { 'A':[1,2,3,5, 9], 'B': [10, 20, 5, 39, 7], 'C':[1,2,3,4,5], 'vinay':[5,4,6,7,8]}
df = pd.DataFrame(my_dict)
df

   A   B  C  vinay
0  1  10  1      5
1  2  20  2      4
2  3   5  3      6
3  5  39  4      7
4  9   7  5      8

In [25]:
df.loc[3]  #1st  row values

A         5
B        39
C         4
vinay     7
Name: 3, dtype: int64

In [28]:
df.iloc[2] # row index

A        3
B        5
C        3
vinay    6
Name: 2, dtype: int64

In [31]:
df.iat[3,3]  #single value interesction of row and col; col & row by index

7

In [32]:
df.at[4,'vinay']  #column by name

8

In [35]:
df.rename(columns = {'A':'newA','C':'Shantini','B':'akash'})

   newA  akash  Shantini  vinay
0     1     10         1      5
1     2     20         2      4
2     3      5         3      6
3     5     39         4      7
4     9      7         5      8

In [36]:
df['B'].apply(lambda x : x+2)

0    12
1    22
2     7
3    41
4     9
Name: B, dtype: int64

In [37]:
df.replace(1,5)

   A   B  C  vinay
0  5  10  5      5
1  2  20  2      4
2  3   5  3      6
3  5  39  4      7
4  9   7  5      8

In [23]:
df.agg({'A':['min', 'max', 'mean', 'sum'],'B':['mean','std']})

         A          B
min    1.0        NaN
max    9.0        NaN
mean   4.0  16.200000
sum   20.0        NaN
std    NaN  13.989282

In [10]:
df1 = pd.DataFrame({'rollno':[1,2,3], 'hr':[4,5,6]})
df2 = pd.DataFrame({'rollno':[1,2,3], 'mm':[7,8,9]})
#print(df1)
#print(df2)
df = pd.merge(df1, df2, on='rollno') 
#merge is more versatile, it requires specifying the columns as a merge key. 
print(df)

   rollno  hr  mm
0       1   4   7
1       2   5   8
2       3   6   9

In [ ]:
df1 = pd.DataFrame({'A':[1,2,3], 'B':[4,5,6]})
df2 = pd.DataFrame({'C':[7,8,9]})
print (df1,'\n', df2)
df = df1.join(df2)  #using index key
df

In [11]:
df['date'] = pd.to_datetime('2024-02-19')
df

   rollno  hr  mm       date
0       1   4   7 2024-02-19
1       2   5   8 2024-02-19
2       3   6   9 2024-02-19

In [ ]:
import datetime as dt

In [12]:
print(df['date'].dt.year)
print(df['date'].dt.month)
print(df['date'].dt.day)

0    2024
1    2024
2    2024
Name: date, dtype: int32
0    2
1    2
2    2
Name: date, dtype: int32
0    19
1    19
2    19
Name: date, dtype: int32

In [14]:
df.to_csv('vinay.csv', index=False)

In [15]:
os.listdir()

['.git',
 '.ipynb_checkpoints',
 'A51_dsBasic.ipynb',
 'A52_dsNP.ipynb',
 'A53_dsPD.ipynb',
 'Class 1 - Practice(14-02-2024) Data Structure Basics .ipynb',
 'Class 2 Practice (16-2-2024) - Numpy.ipynb',
 'file1.ipynb',
 'filedf.csv',
 'vinay.csv']

In [ ]:
## larger DF

In [16]:
df1 = pd.DataFrame({'rollno':[1,2,3,4,5], 
                    'name': [ "Dhiraj", "Vinay", "Akash", "Shanthini","Disha" ], 
                    'marks':[ 40, 50, 60.5, 70, 93 ], 
                    'gender':['M', 'M','M', 'F', 'F']})
print(df1)  # dict format
type(df1)

   rollno       name  marks gender
0       1     Dhiraj   40.0      M
1       2      Vinay   50.0      M
2       3      Akash   60.5      M
3       4  Shanthini   70.0      F
4       5      Disha   93.0      F

pandas.core.frame.DataFrame

In [17]:
print('Column Names - ', df1.columns)  #column names
print('Index/ Row Names - ', df1.index)  #row ids/ names  - here auto created
print('Data Types -\n', df1.dtypes) #data types
print('Shape of DF(R-C) -', df1.shape)  # rows and columns

Column Names -  Index(['rollno', 'name', 'marks', 'gender'], dtype='object')
Index/ Row Names -  RangeIndex(start=0, stop=5, step=1)
Data Types -
 rollno      int64
name       object
marks     float64
gender     object
dtype: object
Shape of DF(R-C) - (5, 4)

In [18]:
print('Describe Values (Numerical)-\t  ')
df1.describe() #description of numerical values

Describe Values (Numerical)-

         rollno      marks
count  5.000000   5.000000
mean   3.000000  62.700000
std    1.581139  20.327322
min    1.000000  40.000000
25%    2.000000  50.000000
50%    3.000000  60.500000
75%    4.000000  70.000000
max    5.000000  93.000000

In [19]:
# Groupby Functions on DF
df1.groupby('gender').size()  # how many M, F

gender
F    2
M    3
dtype: int64

## using Built In Data Sets
-  install pydatasets : !pip install pydataset

In [37]:
#!pip install pydataset

In [1]:
from pydataset import data
mtcars = data('mtcars')
mtcars.shape

initiated datasets repo at: C:\Users\Thari\.pydataset/

(32, 11)

In [9]:
mtcars

,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2
Valiant,18.1,6,225.0,105,2.76,3.460,20.22,1,0,3,1
Duster 360,14.3,8,360.0,245,3.21,3.570,15.84,0,0,3,4
Merc 240D,24.4,4,146.7,62,3.69,3.190,20.00,1,0,4,2
Merc 230,22.8,4,140.8,95,3.92,3.150,22.90,1,0,4,2
Merc 280,19.2,6,167.6,123,3.92,3.440,18.30,1,0,4,4
Merc 280C,17.8,6,167.6,123,3.92,3.440,18.90,1,0,4,4
Merc 450SE,16.4,8,275.8,180,3.07,4.070,17.40,0,0,3,3
Merc 450SL,17.3,8,275.8,180,3.07,3.730,17.60,0,0,3,3
Merc 450SLC,15.2,8,275.8,180,3.07,3.780,18.00,0,0,3,3
Cadillac Fleetwood,10.4,8,472.0,205,2.93,5.250,17.98,0,0,3,4
Lincoln Continental,10.4,8,460.0,215,3.00,5.424,17.82,0,0,3,4
Chrysler Imperial,14.7,8,440.0,230,3.23,5.345,17.42,0,0,3,4
Fiat 128,32.4,4,78.7,66,4.08,2.200,19.47,1,1,4,1
Honda Civic,30.4,4,75.7,52,4.93,1.615,18.52,1,1,4,2
Toyota Corolla,33.9,4,71.1,65,4.22,1.835,19.90,1,1,4,1
Toyota Corona,21.5,4,120.1,97,3.70,2.465,20.01,1,0,3,1
Dodge Challenger,15.5,8,318.0,150,2.76,3.520,16.87,0,0,3,2
AMC Javelin,15.2,8,304.0,150,3.15,3.435,17.30,0,0,3,2
Camaro Z28,13.3,8,350.0,245,3.73,3.840,15.41,0,0,3,4
Pontiac Firebird,19.2,8,400.0,175,3.08,3.845,17.05,0,0,3,2
Fiat X1-9,27.3,4,79.0,66,4.08,1.935,18.90,1,1,4,1
Porsche 914-2,26.0,4,120.3,91,4.43,2.140,16.70,0,1,5,2
Lotus Europa,30.4,4,95.1,113,3.77,1.513,16.90,1,1,5,2
Ford Pantera L,15.8,8,351.0,264,4.22,3.170,14.50,0,1,5,4
Ferrari Dino,19.7,6,145.0,175,3.62,2.770,15.50,0,1,5,6
Maserati Bora,15.0,8,301.0,335,3.54,3.570,14.60,0,1,5,8
Volvo 142E,21.4,4,121.0,109,4.11,2.780,18.60,1,1,4,2

In [8]:
data()

        dataset_id                                             title
0    AirPassengers       Monthly Airline Passenger Numbers 1949-1960
1          BJsales                 Sales Data with Leading Indicator
2              BOD                         Biochemical Oxygen Demand
3     Formaldehyde                     Determination of Formaldehyde
4     HairEyeColor         Hair and Eye Color of Statistics Students
..             ...                                               ...
752        VerbAgg                  Verbal Aggression item responses
753           cake                 Breakage Angle of Chocolate Cakes
754           cbpp                 Contagious bovine pleuropneumonia
755    grouseticks  Data on red grouse ticks from Elston et al. 2001
756     sleepstudy       Reaction times in a sleep deprivation study

[757 rows x 2 columns]

In [10]:
mtcars.head()

,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2

In [11]:
mtcars.head(2)

                mpg  cyl   disp   hp  drat     wt   qsec  vs  am  gear  carb
Mazda RX4      21.0    6  160.0  110   3.9  2.620  16.46   0   1     4     4
Mazda RX4 Wag  21.0    6  160.0  110   3.9  2.875  17.02   0   1     4     4

In [13]:
mtcars.describe(include="all")

,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
count,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.0000
mean,20.090625,6.187500,230.721875,146.687500,3.596563,3.217250,17.848750,0.437500,0.406250,3.687500,2.8125
std,6.026948,1.785922,123.938694,68.562868,0.534679,0.978457,1.786943,0.504016,0.498991,0.737804,1.6152
min,10.400000,4.000000,71.100000,52.000000,2.760000,1.513000,14.500000,0.000000,0.000000,3.000000,1.0000
25%,15.425000,4.000000,120.825000,96.500000,3.080000,2.581250,16.892500,0.000000,0.000000,3.000000,2.0000
50%,19.200000,6.000000,196.300000,123.000000,3.695000,3.325000,17.710000,0.000000,0.000000,4.000000,2.0000
75%,22.800000,8.000000,326.000000,180.000000,3.920000,3.610000,18.900000,1.000000,1.000000,4.000000,4.0000
max,33.900000,8.000000,472.000000,335.000000,4.930000,5.424000,22.900000,1.000000,1.000000,5.000000,8.0000

In [4]:
mtcars.columns

Index(['mpg', 'cyl', 'disp', 'hp', 'drat', 'wt', 'qsec', 'vs', 'am', 'gear',
       'carb'],
      dtype='object')

In [ ]:
# settings of pandas
# https://pandas.pydata.org/docs/user_guide/options.html
pd.set_option('display.max_columns', None)
pd.set_option('max_colwidth', None)
pd.set_option("expand_frame_repr", True)
pd.set_option("max_info_columns", 11)
pd.set_option("display.precision", 3)
pd.set_option('display.width', 1000)  #wrap with full display

In [5]:
np.set_printoptions(edgeitems=30, linewidth=100000,   formatter=dict(float=lambda x: "%.3g" % x))

NameError: name 'np' is not defined

In [6]:
mtcars.columns

Index(['mpg', 'cyl', 'disp', 'hp', 'drat', 'wt', 'qsec', 'vs', 'am', 'gear',
       'carb'],
      dtype='object')

In [12]:
mtcars.mean()

mpg      20.090625
cyl       6.187500
disp    230.721875
hp      146.687500
drat      3.596563
wt        3.217250
qsec     17.848750
vs        0.437500
am        0.406250
gear      3.687500
carb      2.812500
dtype: float64

In [14]:
mtcars.agg(["mean","median","std","min","max","count"])

,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
mean,20.090625,6.187500,230.721875,146.687500,3.596563,3.217250,17.848750,0.437500,0.406250,3.687500,2.8125
median,19.200000,6.000000,196.300000,123.000000,3.695000,3.325000,17.710000,0.000000,0.000000,4.000000,2.0000
std,6.026948,1.785922,123.938694,68.562868,0.534679,0.978457,1.786943,0.504016,0.498991,0.737804,1.6152
min,10.400000,4.000000,71.100000,52.000000,2.760000,1.513000,14.500000,0.000000,0.000000,3.000000,1.0000
max,33.900000,8.000000,472.000000,335.000000,4.930000,5.424000,22.900000,1.000000,1.000000,5.000000,8.0000
count,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.0000

## Export Data to CSV/ Excel
-  write to csv 
    -  https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.to_csv.html
-  write to excel
-   -  https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.to_excel.html
-  write to other formats

In [19]:
mtcars.to_csv( 'mtcars.csv')
', '.join(os.listdir())

NameError: name 'os' is not defined

In [ ]:
import glob  #search file with pattern
glob.glob("*.csv")

In [ ]:
mtcars.to_excel('mtcars.xlsx')

In [ ]:
glob.glob("*.xlsx")

## Import Data to CSV/ Excel/ Web CSV
-  from csv
-  from excel
    -  https://pandas.pydata.org/docs/reference/api/pandas.read_excel.html

In [ ]:
df1 = pd.read_csv('mtcars.csv')
df1.head()

In [ ]:
df1B = df1.drop("Unnamed: 0", axis=1)
df1B.head()

### remove unnamed column or at the time of saving to csv, don't save index column
-  mtcars.to_csv('mtcars.csv', index=False)
-  mtcars.to_excel('mtcars.xlsx', index=False)

In [ ]:
df2 = pd.read_excel('mtcars.xlsx', sheet_name=0)
df2.head()

In [ ]:
# Not try import your own data in excel or csv into python and do summary

## Links
-  https://pandas.pydata.org/docs/user_guide/index.html
-  https://pandas.pydata.org/docs/reference/index.html

### Next
-  do summary actions on dataframe structure